[{
	"pid":0,
	"projectShortName": "Campaign for Georgetown",
	"projectLongName": "",
	"descA":"This site was created to announce the public phase of Georgetown University's $1.5 billion dollar campaign, <em>For Generations to Come</em>. The site was continually updated with fundraising progress and news for the duration of the public phase until its successful end.<br><br>A notable aspect of this project is the flip ticker on the progress page. The final amounts are entered into hidden fields, read by a jQuery script, then used to animate an array of images until the total is reached.",
	"descB":"During the design of this site, I had a fascination with gradients and grooves/lines that fade out on the edges. The container background has a radial gradient with a slightly lighter blue to draw the eye to the center. The hero image at the top was a slideshow at the site’s launch with smaller images at the sides that simultaneously rotated to give the impression of enlargement.",
	"role":"I designed mockups in photoshop, built them out into the site layout, and scripted the slideshow and flip ticker.",
	"path":"assets/Campaign/",
	"cover":["Campaign_cover.jpg"],
	"images":["Campaign_01.jpg", "Campaign_02.jpg"],
	"imageSize":[],
	"imageDesc":["The homepage layout features a large hero image that bleeds outside of the content container. Prior to the end of the campaign, the hero space included a slideshow in which the bleed effect also rotated through slides.", "The subpage layout with sections styled to be used as callout space."],
	"animations":["Campaign_01.gif"],
	"animSize":["left"],
	"animDesc":["The ticker for campaign donation progress. Several images of numbers, split in half, are animated on page load. They count up until they reach the number specified in a hidden field in the HTML."],
	"videos":[],
	"videosDesc":[],
	"year":2009,
	"tags":["html", "css", "javascript", "Photoshop", "georgetown", "jQuery"]
},
{
	"pid":1,
	"projectShortName": "Class Ambassadors",
	"projectLongName": "",
	"descA":"Georgetown's Office of Advancement needed a website to provide resources to class leaders and relay class fundraising information. The class progress page features animated graphs that track fundraising progress by class year.",
	"descB":"The fundraising graphs were made using jQuery and Charts.js to visualize data from a Google spreadsheet which allowed staff to update the graph data in real-time using a familiar interface. JQuery is used to store graphs in accordion panes by decade, and to overlay graphs with more detailed data in a tooltip.",
	"role":"Since the design for the site was related to an older version of the main Advancement site, there wasn’t much room for creative freedom. However, I created the menu, sidebar buttons, and the Charts.js graphs.",
	"path":"assets/Ambassadors/",
	"cover":["Ambassadors_cover.jpg"],
	"images":["Ambassadors_01.jpg"],
	"imageSize":[],
	"imageDesc":["Class Ambassadors page layout, originally made to compliment the older Georgetown Alumni website."],
	"animations":["Ambassadors_01.gif"],
	"animSize":[],
	"animDesc":["Charts.js animations used for class donation progress tracking."],
	"videos":[],
	"videosDesc":[],
	"year":2013,
	"tags":["html", "css", "javascript", "Photoshop", "georgetown", "charts.js", "jQuery"]
},
{
	"pid":2,
	"projectShortName": "Advent Calendar",
	"projectLongName": "",
	"descA":"Launched in December 2014, this advent calendar counted down until Christmas day with each past day's icon flipped to red. Users can click on a day to find a goodie, game, or other activity.",
	"descB":"This site makes use of masonry.js to display the days as well as the panels for each activity. I also had fun experimenting with CSS transitions to create the flip effect for each calendar day. At some point, I became a little too creative and a feature had to be stripped from the final product. However, it quietly lives on as an easter egg buried in the corner of the browser.",
	"role":"I created the shell that displays the calendar days and presents each day’s activities when clicked. I also created the graphics using a similar technique to that used in <a href='/#/project/3'><em>A Very Hoya Holiday</em></a> of a color and ink aesthetic.",
	"path":"assets/Advent/",
	"cover":["Advent_cover.jpg"],
	"images":["Advent_01.jpg"],
	"imageSize":[],
	"imageDesc":["The advent calendar landing page, each day includes css transition animations in a masonry layout."],
	"animations":["Advent_01.gif", "Advent_02.gif"],
	"animSize":["left","left"],
	"animDesc":["Calendar days are styled with CSS3 transforms and backfacing to give an animated two-sided effect on hover", "A small hover effect pops up from the corner with a pulsating glow driven by the CSS animation property. When clicked, it triggers the site's built-in easter egg."],
	"videos":[],
	"videosDesc":[],
	"year":2014,
	"tags":["html", "css", "javascript", "masonry.js", "Photoshop"]
},
{
	"pid":3,
	"projectShortName": "A Very Hoya Holiday",
	"projectLongName": "",
	"descA":"For holiday season 2012 our team decided to do something fun in creating a <em>parallax scrolling</em> site, and had a blast creating the graphics for this short poem.",
	"descB":"This page uses a halftone aesthetic and animated .gifs to tell a campus-themed holiday tale. Images were taken from actual photos of campus and run through filters to produce black &amp; white &quot;ink&quot; outlines, and color layers beneath them to impart the comic book appearance. Although it didn’t receive an award, it did get an honorable mention in CASE magazine, and garnered plenty of praise from other departments and students within the university.",
	"role":"I created the halftone backgrounds and all illustrations. The development of the project shell was a collaboration between myself and a temporary employee I advised for a few weeks. We implemented the parallax effect using jQuery and stellar.js, and timed many of the animations to coincide with their respective panels.",
	"path":"assets/Hoya_Holiday/",
	"cover":["HoyaHoliday_cover.jpg"],
	"images":[],
	"imageSize":[],
	"imageDesc":[""],
	"animations":["HoyaHoliday_01.gif", "HoyaHoliday_02.gif"],
	"animSize":[],
	"animDesc":["Two frames with continuous animation. Jack the bulldog sleeps, and CSS animates his Zs whereas the clockface of Healy Hall is an animated .gif", "Another example of panel transitions and animations."],
	"videos":[],
	"videosDesc":[],
	"year":2012,
	"tags":["html", "css", "javascript", "parallax", "stellar.js", "Photoshop"]
},
{
	"pid":4,
	"projectShortName": "Georgetown Alumni Magazine",
	"projectLongName": "",
	"descA":"Before Georgetown alumni publications were housed in a Drupal environment, I was tasked with building a site to host featured articles separate from the main alumni site, which at the time was plagued by an unworkable CMS.",
	"descB":"This site was one of my first attempts at responsive design. I fool-hardily avoided using a pre-existing library and created a stylesheet on my own. The design featured articles arranged by tier, with higher priority content occupying more screen space. The site was received favorably by coworkers and readers, and continued for two years until our transition to Drupal.",
	"role":"The design was based on mock-ups provided by a freelance designer. I was responsible for duplicating the design with markup and stylesheets. The provided mock-ups did not include a responsive configuration as the technique hadn’t yet become ubiquitous. However, I styled the site with the necessary breakpoints, and wrote a script to rearrange the DOM to satisfy a request that the sidebar collapse into the content instead of below it.",
	"path":"assets/Magazine/",
	"cover":["Magazine_cover.jpg"],
	"images":["Magazine_01.jpg", "Magazine_02.jpg"],
	"imageSize":[],
	"imageDesc":["Georgetown Magazine above the fold view, featuring a large hero image slider for top tier stories","Georgetown Magazine below the fold view. Tier two and three stories with a sidebar that collapses into the layout"],
	"animations":["Magazine_01.gif"],
	"animSize":[],
	"animDesc":["The menu uses a full-width dropdown with CSS color transitions."],
	"videos":[],
	"videosDesc":[],
	"year":2012,
	"tags":["html", "css", "javascript", "responsive"]
},
{
	"pid":5,
	"projectShortName": "Georgetown Giving Donation Form",
	"projectLongName": "",
	"descA":"The backend for the university's giving forms were vendor-provided and the supplied front-end design was bare. I had access to a stylesheet and a javascript file to effect changes.",
	"descB":"The challenge was to make the form match Georgetown’s Blue &amp; Gray color scheme, but also to make form controls visible and wieldy to the elderly who overwhelmingly make up the largest donors. To restyle the form, I used labels to replace form elements like checkboxes and radio buttons, substituting them with an oversized graphical checkbox styled and animated with CSS, and toggle buttons, respectively. When users interacted with the superficial representations of form elements, the corresponding form controls recorded the changes for submission.",
	"role":"I was primarily responsible for visually restyling the form elements and subsections of the form. I also added the show/hide behavior under toggle switches. It was a particularly strange experience because the markup provided by the vendor was table-based and heavily loaded with inconsistent and unique IDs that required a relative approach when telling a switch to affect its parent’s grandchild’s second cousin… twice removed.",
	"path":"assets/Giving/",
	"cover":["Giving_cover.jpg"],
	"images":["Form_01.jpg"],
	"imageSize":[],
	"imageDesc":["The giving form with gradient backgrounds for text input and collapsible accordion panels for different form sections."],
	"animations":["Form_01.gif", "Form_02.gif"],
	"animSize":["","left"],
	"animDesc":["An example of styled checkboxes with a quick animation when checked. The actual check mark is created by pseudo elements.", "The 'radio button' form element replaced by a toggle button that triggers javascript to show and hide additional information."],
	"videos":[],
	"videosDesc":[],
	"year":2014,
	"tags":["css", "javascript"]
},
{
	"pid":6,
	"projectShortName": "John Carroll Weekend",
	"projectLongName": "",
	"descA":"An annual university event that brings alumni together to share ideas, attend discussion panels, and enjoy the culture of its international locations.",
	"descB":"The responsive design features transitioning background images overlaid with semi-transparent panels in a break from fully-opaque designs of the past thanks to CSS3. Since this event is annual, each year brings a new iteration with different features. One year, all events were displayed on a leaflet map, another year a video gallery, tabs to separate hotel tiers, and a corresponding mobile app. This year, when asked to add another tab to the schedule page. Instead of adding another tab, I took all schedule data and created an AngularJS app that orders and filters events by time, status, and day. The change resulted in a reduction from four pages representing each day to a single page application.",
	"role":"I built the prototype based on suggestions from the communication director, who wanted the site to focus on imagery related to each international location and minimize the wall-of-text that was a mainstay of an older design that had been reskinned yearly since 2005. I was responsible for the markup, CSS styling, photo &amp; video gallery scripts, the background rotation script, the leaflet mapping widget, and most recently, the angular event search application.",
	"path":"assets/JCW/",
	"cover":["JCW_cover.jpg"],
	"images":["JCW_01.jpg", "JCW_02.jpg", "JCW_03.jpg", "JCW_04.jpg"],
	"imageSize":[],
	"imageDesc":["John Carrol Weekend gallery, generated originally from xml and later converted to JSON", "John Carroll Weekend gallery, opened state.", "An AngularJS Schedule App. I was asked to update an older version of the schedule that relied on separate HTML pages. I had heard that one of the requests was to include a search for the events, but it was mentioned in passing and dismissed out of hand. I figured this would be an excellent opportunity to leverage the power of angular filters.<br><br>The event data is stored in JSON format and fed into a template that repeats the original schedule structure for each entry. However, in this version I've included a search bar to narrow down events, and buttons that filter the content to show only open events or only events for certain days. On top of those advantages, all days of the schedule are consolidated onto a single page.", "The search function in action, narrowing down events by day and content."],
	"animations":["JCW_01.gif", "JCW_02.gif"],
	"animSize":["left", "left"],
	"animDesc":["Full size background transitions showing off the local sights of the event location.", "Responsive resizing of the menu with CSS transitions."],
	"videos":[],
	"videosDesc":[],
	"year":2013,
	"tags":["html", "css", "javascript", "jQuery", "angular", "responsive", "leaflet.js"]
},
{
	"pid":7,
	"projectShortName": "Georgetown University Reunion",
	"projectLongName": "",
	"descA":"Georgetown University's reunion site had a very web 1.0 design dating back to 2002 that, save for the 2006 design, varied little for 9 years. By 2007 it had become stale.",
	"descB":"A redesign to the printed promotional materials prompted interest in testing out a new look for the website in 2011. I based the design on the color scheme of the related print pieces. However, beyond the header, the website becomes unique from its print counterpart. I wanted to make sure I kept the white color pallette, but I also wanted to show depth in page elements. In addition, I wanted to evoke the look of pillars to impress on the visitor a sense of permanence and importance. I incorporated the concave indentations of pillars horizontally into the navigation background. As for depth, page elements overlap one another visually, but only at the top to establish content hierarchy. Soft fades gradually remove the visual effect below the fold.",
	"role":"I designed mockups in photoshop before cutting them up to create a template. As this was before many CSS3 effects were widely implemented across browsers, the majority of the website’s visual style was accomplished using background images from the photoshop mock-up. I created the visual design, and wrote the accompanying HTML, CSS, and Javascript.",
	"path":"assets/Reunion/",
	"cover":["Reunion_cover.jpg"],
	"images":["ReunionHP_01.png", "ReunionMenu_01.png"],
	"imageSize":[],
	"imageDesc":["Reunion landing page layout featuring overlapping regions to give a sense of depth.", "Reunion two-tier navigation, styled to give a chiseled look to the design"],
	"animations":["Reunion_01.gif"],
	"animSize":[],
	"animDesc":["The two-tier navigation in action."],
	"videos":[],
	"videosDesc":[],
	"year":2011,
	"tags":["html", "css", "javascript", "Photoshop"]
},
{
	"pid":8,
	"projectShortName": "Georgetown University Homecoming",
	"projectLongName": "",
	"descA":"Homecoming, like John Carroll Weekend and Reunion, is a “signature event” of the university. Like the other two sites, I am honored to have been in charge of all three designs during my time at Georgetown.",
	"descB":"As our workforce expanded, the time came for me to pass the torch to the graphic design team. However, I’ve still added a little bit of my pizzaz in the form of the latest iteration's header animation, which was created from assets in an event poster. The <a href='https://web.archive.org/web/20100819125750/http://homecoming.georgetown.edu/' target='_blank'>2010-2013</a> design featured visual choices similar to the university athletic department: interlacing, glossy buttons and a little bit of depth. The header background had faded oval gradients to appear as though the title were spotlighted, and a slider gallery of nostalgic photos from previous years welcomed the users on the homepage.",
	"role":"I designed the site with mock-ups in photoshop, then cut up the design to create a template. I wrote the HTML, CSS, and Javascript. I also created an <a href='https://youtu.be/FjH6BYaK6yc' target='_blank'>accompanying video</a> celebrating the university’s bulldog mascot throughout the years.",
	"path":"assets/Homecoming/",
	"cover":["HC_cover.jpg"],
	"images":["HC_01.jpg"],
	"imageSize":[],
	"imageDesc":["Homecoming 2012 homepage layout."],
	"animations":["HC_01.gif"],
	"animSize":[],
	"animDesc":["The 2014 introductory animation, created in flash, for the homecoming homepage. Smaller screens display static image instead."],
	"videos":[],
	"videosDesc":[],
	"year":2010,
	"tags":["html", "css", "javascript", "Photoshop", "illustrator", "flash"]
},
{
	"pid":9,
	"projectShortName": "Georgetown Investment Report",
	"projectLongName": "",
	"descA":"The advancement office at Georgetown must communicate its impact to donors and board members. The fundraising data was traditionally presented in printed format, and I undertook the creation of its digital counterpart.",
	"descB":"The digital version was originally created using MegaZine, which allowed users to ‘grab’ and ‘flip’ through pages. In the 2011 version, it even featured an Autodesk Maya 3D animation of bar graphs describing campaign progress. However, the MegaZine software was based in Adobe’s Flash and actionscript, and eventually became obsolete. In 2014, the project was repurposed as a single page stack of panes with parallax backgrounds and navigation waypoints to move the user quickly to the desired content.",
	"role":"I was responsible for both the Flash version and the HTML parallax version start-to-finish. I designed and coded both versions, actionscript for the former and jQuery for the latter. For the flash version I created 3D animations. In the HTML version I performed some light photo editing to remove blemishes and shine.",
	"path":"assets/Investment_Reports/",
	"cover":["InvestmentReport_cover.jpg"],
	"images":["2015Cover.png"],
	"imageSize":[],
	"imageDesc":["The cover image for the 2015 investment report."],
	"animations":["InvestmentReport_2014_02.gif", "InvestmentReport_2015_01.gif"],
	"animSize":["left", "right"],
	"animDesc":["A quick run-through of the 2014 Investment Report", "A quick run-through of the 2015 Investment Report"],
	"videos":[],
	"videosDesc":[],
	"year":2014,
	"tags":["html", "css", "javascript", "jQuery", "responsive"]
},
{
	"pid":10,
	"projectShortName": "Corporate and Foundation Relations",
	"projectLongName": "",
	"descA":"This is a jQuery application designed to search grant submissions. The data is stored using a Google form, and parsed from the resulting CSV into JSON.",
	"descB":"This project was a unique assignment since it involved enabling the user to search through the grants with multiple criteria. I hadn’t started studying Angular yet, so it was quite a challenge. The script searches objects for the specified search criteria before passing the filtered object to the next filter. Once a fully-filtered object is returned, the results are counted, tagged with an indicator if they’re new, and paginated in chronological order by due date. The Google spreadsheet has it’s own small script that allows the page managers to input data using a Google form, and then copies the data to a second sheet with headers formatted for JSON use.",
	"role":"After being presented with the problem, I concepted and built a prototype and then expanded on the basics. The site is styled to fit in with the Corporate &amp; Foundation Relations homepage and has served the department for almost three years.",
	"path":"assets/CFR/",
	"cover":["CFR_cover.jpg"],
	"images":["CFR_01.png", "CFR_03.jpg"],
	"imageSize":[],
	"imageDesc":["Corporate and Foundation Relations homepage with paginated listings and search form.", "Search form jQuery UI datepicker widget."],
	"animations":[],
	"animSize":[],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2013,
	"tags":["html", "css", "javascript", "JSON"]
},
{
	"pid":11,
	"projectShortName": "Georgetown Alumni Weekend: Hong Kong",
	"projectLongName": "",
	"descA":"Georgetown hosts seasonal alumni events as well as international gatherings to ensure that the most far-flung Hoyas maintain contact with the Georgetown community. It is akin to a smaller John Carroll Weekend.",
	"descB":"The design features a fixed, full-width hero image of Hong Kong at night, and css animations in the navigation. Images of the host hotel for the event are contained in a Nivo Slider, and I was able to use my rudimentary Mandarin education to accent the headings of each section with Hanzi characters.",
	"role":"I designed, prototyped, and built this site with HTML, CSS, and jQuery.",
	"path":"assets/Alumni_Weekend/",
	"cover":["HK_cover.jpg"],
	"images":["HK_01.jpg"],
	"imageSize":[],
	"imageDesc":["Alumni Weekend: Hong Kong homepage layout."],
	"animations":["HK_01.gif"],
	"animSize":[],
	"animDesc":["Responsive layout in action."],
	"videos":[],
	"videosDesc":[],
	"year":2014,
	"tags":["html", "css", "javascript", "responsive"]
},
{
	"pid":12,
	"projectShortName": "March Madness 2014",
	"projectLongName": "",
	"descA":"This site commemorated the 30th anniversary of the 1984 NCAA championship win by the Georgetown Hoyas. The experience is driven by a Masonry.js interface where tiles part to present content in the center.",
	"descB":"This site is similar to the Advent Calendar project in that it uses Masonry.js to present the user with options that give way to content. Content varies from images with text descriptions to including Nivo Sliders and video. When the content pane is closed, the tiles rearrange themselves and a script randomizes their shade of blue or gray.",
	"role":"I had conveniently already developed the skeleton for this project in my spare time when the problem was presented in a meeting. It turned out to be a natural fit.",
	"path":"assets/MM2014/",
	"cover":["MM_cover.jpg"],
	"images":["MM_01.jpg"],
	"imageSize":[],
	"imageDesc":["March Madness 2014 landing page."],
	"animations":["MM_01.gif", "MM_02.gif"],
	"animSize":[],
	"animDesc":["An example of opacity transitions applied to each tile on hover.", "An example of the insertion of content between tiles, followed by masonry reorganizing, randomizing, and recoloring each."],
	"videos":[],
	"videosDesc":[],
	"year":2014,
	"tags":["html", "css", "javascript", "masonry", "responsive"]
},
{
	"pid":13,
	"projectShortName": "Haysbert Moultrie",
	"projectLongName": "",
	"descA":"This was a freelance site I was commissioned to create in anticipation of a press release regarding one of the law firm's cases. The site was created using Twitter's Bootstrap CSS framework.",
	"descB":"The client requested a theme of espionage and wanted the site to be dark but sleek and professional. The homepage features a content area with revolving quotes on a backdrop of CCTV cameras, a compass and map, hexadecimal code, and a face obscured by shadow. I used a fabric texture for the white space on the homepage, and the header on subpages. The navigation buttons also have a CSS transition applied to their hover state. Simple, but effective for the two days I was allotted.",
	"role":"I went straight-to-prototype, creating the site with HTML, Bootstrap CSS, and a small PHP mailer script.",
	"path":"assets/Haysbert_Moultrie/",
	"cover":["HM_cover.jpg"],
	"images":["HM_01.png"],
	"imageSize":[],
	"imageDesc":["Haysbert Moultrie landing page"],
	"animations":["HM_01.gif"],
	"animSize":[],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2015,
	"tags":["html", "css", "javascript", "bootstrap", "responsive"]
},
{
	"pid":14,
	"projectShortName": "Quality Consultants Group",
	"projectLongName": "",
	"descA":"Quality Consultants Group, a fresh strategy consulting firm serving the DC Metro area, had a Wix site, but lacked the resources to marshall Wix’s tools into a clean design. That’s where someone like me comes in handy.",
	"descB":"What had previously been a time sink for the client became a walk in the park for someone that lives in code every day. I quickly set about hacking at the interface to hide cumbersome elements for mobile users, align headers and images, and set the desired color scheme.",
	"role":"This site was already in existence. My job was to correct alignment issues, make page layouts consistent across the site, set the color scheme, and correct mobile issues.",
	"path":"assets/QCG/",
	"cover":["QCG_cover.jpg"],
	"images":["QCG_01.jpg", "QCG_01.png"],
	"imageSize":[],
	"imageDesc":[],
	"animations":[],
	"animSize":[],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2015,
	"tags":["html", "css"]
},
{
	"pid":15,
	"projectShortName": "Holiday E-Wreath Creator",
	"projectLongName": "",
	"descA":"Each winter holiday season at Georgetown is an opportunity to indulge in experimental projects. For 2011, I created a greeting card generator that allowed users to position and resize wreaths, bells, ornaments, and ribbons on a photo of the door to the Old North building.",
	"descB":"I was <em>really</em> into skeuomorphism then, so the interface features bevels, folded-up corners, screws(!), and even Christmas lighting. This was an entertaining experiment with jQuery UI and URL encoding. As users position items on the image, their selections with x &amp; y locations are stored in an array. Once the user has written a message, the array of objects and the message are encoded into a URL. At first, the URLs were incredibly long and unwieldy. I solved this issue by feeding the encoded URL into bit.ly to provide users with a shortened URL to share instead. Once a user clicked the link, the script would reconstruct the image and append the message. This site is a testament to my tenacity, as I worked my way through the functionality to build a complex result, and learning about jQuery UI as well as expanding my knowledge of jQuery’s event object along the way.",
	"role":"I designed mock-ups in photoshop before translating them to a build. I built the final version using HTML, CSS, and jQuery with jQuery UI.",
	"path":"assets/ewreath/",
	"cover":["ewreath_cover.png"],
	"images":["ewreath_01.jpg", "ewreath_02.jpg", "ewreath_04.jpg"],
	"imageSize":["", "", ""],
	"imageDesc":["The E-Wreath Creator layout with the stage on the left, and toolbox on the right. Each item creates a duplicate instance of itself when dragged and dropped on the stage.", "The button that saves and shares the user's creation. Skeuomorphic screws and bevels appear like a plate bolted in place.", "The reset button to discard all work and start over fresh. Aside from having a convex shape, it has a small concave circle seemingly carved into it.", "The share modal box shown once the 'Make Card' button is clicked. It includes a shortened URL as well as social network buttons to share your creation with friends."],
	"animations":[],
	"animSize":[],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2011,
	"tags":["html", "css", "jQuery", "jQueryUI"]
},
{
	"pid":16,
	"projectShortName": "Devices 3D Illustration",
	"projectLongName": "",
	"descA":"For the launch of our new Drupal site, I created a 3D illustration in Blender. I modeled each device, then rendered them with the “freestyle” option to add outlines.",
	"descB":"This was a fun challenge to create 3D assets. I had primarily been using Blender for simulations up to this point, so actual modeling was a shift in how I had previously interacted with the program. It’s a good feeling when you forego stock imagery to add your own creative input.",
	"role":"Modelling, texturing, and rendering.",
	"path":"assets/Devices/",
	"cover":["devices_cover.png"],
	"images":["devices_02.png", "devices_01.png"],
	"imageSize":[],
	"imageDesc":["My first attempt at a final render after modeling. The original concept was to have them all connected, however it was later revised.","The final version of the graphic, used as a hero image atop a page describing features of the new website. I tweaked the colors a bit and modeled new devices, properties of surfaces such as screens became more uniform."],
	"animations":[],
	"animSize":[],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2015,
	"tags":["blender", "Photoshop"]
},
{
	"pid":17,
	"projectShortName": "Thanksgiving 3D Animation",
	"projectLongName": "",
	"descA":"I set out to build an animated .gif greeting for Thanksgiving. The goal was to make an animation of falling leaves. To achieve this, I used Blender 3D’s physics engine to simulate the leaves falling and being blown in the wind.",
	"descB":"The leaves were created using leaf textures with an alpha map to give each individual leaf instance depth so the leaf veins would pop out. The leaf textures also had translucency so they would glow from the ‘sun’ striking it while also allowing a bit of light to pass through. The cameras used to render the final composition had depth of field applied to them so that leaves in the distance were more blurred than those closer to the camera. I tweaked the settings of the resulting .gif to skip and pause for a little on each frame in order to not only reduce file size, but keep the animation speed true to the original. Although the goal was to produce a .gif, I didn’t feel it fully did the animation justice, so I also published the original video to YouTube.",
	"role":"Modelling, simulating, rendering, video editing, and .gif animation.",
	"path":"assets/Thanksgiving/",
	"cover":["Thanksgiving_cover.png"],
	"images":[],
	"imageSize":[],
	"imageDesc":[""],
	"animations":["Leaves_Final_gif.gif"],
	"animSize":["natural"],
	"animDesc":["The final version of the leaf animation sent by email. When converting the video to .gif, I skipped frames, and made each frame pause for a moment in order to keep the speed similar to the original video while keeping file size compact."],
	"videos":["assets/Thanksgiving/GU_HappyThanksgiving.mp4"],
	"videosDesc":["The full-resolution video version of the Tranksgiving greeting to which the email-optimized .gif version directed users."],
	"year":2015,
	"tags":["blender", "Photoshop", "After Effects"]
},
{
	"pid":18,
	"projectShortName": "Calendar Year End Animation",
	"projectLongName": "",
	"descA":"The development office requested an animation to communicate that time was running out to donate to the university for the fiscal year.",
	"descB":"The animation was to be a clock ticking down, and I decided that Adobe After Effects would be the perfect tool to solve the problem. I created a simple clock animation using After Effects keyframes. Then, I overlaid the clock animation on an image of Healy Hall and skewed the perspective of the clock to appear as though it were angled back into the image.",
	"role":"Clock design in Illustrator, background and gif output from Photoshop, animation in After Effects",
	"path":"assets/Cyeanim/",
	"cover":["CYE_cover.jpg"],
	"images":[],
	"imageSize":[],
	"imageDesc":[],
	"animations":["CYE_ClockCountdown.gif"],
	"animSize":["small"],
	"animDesc":[],
	"videos":[],
	"videosDesc":[],
	"year":2015,
	"tags":["illustrator", "Photoshop", "After Effects"]
},
{
	"pid":19,
	"projectShortName": "Blender Animations",
	"projectLongName": "",
	"descA":"When I catch a good long break between building, managing business and property, I like to hone my skill at using the open source software Blender 3D. Here are a few examples of my experimentation.",
	"descB":"",
	"role":"Modelling, simulating, rendering, and video editing",
	"path":"assets/Blender/",
	"cover":["Blender_cover.png"],
	"images":[],
	"imageSize":[],
	"imageDesc":[],
	"animations":["particle_ring2.gif"],
	"animSize":["natural"],
	"animDesc":["An animation of particles generated from points on a ring. There's a harmonic force field pulling them inward while a vortex field adds spin. Halfway through, the power of both is increased, bringing the particles in and accelerating them."],
	"videos":["assets/Blender/MoleculeBox_1.mp4"],
	"videosDesc":["An array of glass spheres created by Blender's molecular plugin. The spheres are arranged within the volume of a cube, and scatter when colliding with the floor. Afterwards, a fluctuating forcefield throws them around. To help visualize, each sphere's vector and velocity is represented by hue and intensity."],
	"year":2015,
	"tags":["blender", "Photoshop"]
}]